tf plan, bump to `1.18.2`
```
Terraform will perform the following actions:

  # module.cert_manager.helm_release.cert_manager will be updated in-place
  ~ resource "helm_release" "cert_manager" {
      ~ id                         = "cert-manager" -> (known after apply)
      ~ metadata                   = {
          ~ app_version    = "v1.17.4" -> (known after apply)
          ~ chart          = "cert-manager" -> (known after apply)
          ~ first_deployed = 1756195934 -> (known after apply)
          ~ last_deployed  = 1756285410 -> (known after apply)
          ~ name           = "cert-manager" -> (known after apply)
          ~ namespace      = "cert-manager" -> (known after apply)
          ~ notes          = <<-EOT

                cert-manager v1.17.4 has been deployed successfully!

                In order to begin issuing certificates, you will need to set up a ClusterIssuer
                or Issuer resource (for example, by creating a 'letsencrypt-staging' issuer).

                More information on the different types of issuers and how to configure them
                can be found in our documentation:

                https://cert-manager.io/docs/configuration/

                For information on how to configure cert-manager to automatically provision
                Certificates for Ingress resources, take a look at the `ingress-shim`
                documentation:

                https://cert-manager.io/docs/usage/ingress/
            EOT -> (known after apply)
          ~ revision       = 2 -> (known after apply)
          ~ values         = jsonencode(
                {
                  - cainjector      = {
                      - replicaCount = 1
                    }
                  - crds            = {
                      - enabled = true
                      - keep    = true
                    }
                  - ingressShim     = {
                      - defaultIssuerKind = "ClusterIssuer"
                      - defaultIssuerName = "letsencrypt-production"
                    }
                  - prometheus      = {
                      - enabled        = true
                      - servicemonitor = {
                          - enabled = true
                        }
                    }
                  - replicaCount    = 1
                  - securityContext = {
                      - fsGroup = 1001
                    }
                  - serviceAccount  = {
                      - annotations = {
                          - "eks.amazonaws.com/role-arn" = "arn:aws:iam::754256621582:role/cert-manager.cp-2608-0754.cloud-platform.service.justice.gov.uk"
                        }
                      - create      = true
                    }
                  - webhook         = {
                      - replicaCount = 1
                    }
                }
            ) -> (known after apply)
          ~ version        = "v1.17.4" -> (known after apply)
        }
        name                       = "cert-manager"
      ~ version                    = "v1.17.4" -> "v1.18.2"
        # (26 unchanged attributes hidden)
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```